IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/ADC0.xml
<module name="ADC0" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="ADCREGS_REVISION" acronym="ADCREGS_REVISION" offset="0x0" width="32" description="IP Revision Identifier (X.Y.R) Used by software to track features, bugs, and compatibility">
		<bitfield id="MODID" width="16" begin="31" end="16" resetval="0x27072" description="Module ID field" range="31 - 16" rwaccess="R"/> 
		<bitfield id="REVRTL" width="5" begin="15" end="11" resetval="0x7" description="RTL revision. Will vary depending on release." range="15 - 11" rwaccess="R"/> 
		<bitfield id="REVMAJ" width="3" begin="10" end="8" resetval="0x1" description="Major revision" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom" range="7 - 6" rwaccess="R"/> 
		<bitfield id="REVMIN" width="6" begin="5" end="0" resetval="0x0" description="Minor revision" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="ADCREGS_DMAENABLE_SET" acronym="ADCREGS_DMAENABLE_SET" offset="0x38" width="32" description="The DMAENABLE_SET register allows the enabling of DMA requests">
		<bitfield id="ENABLE1" width="1" begin="1" end="1" resetval="0x0" description="enable DMA reguest FIFO1" range="1" rwaccess="R/W1TS"/> 
		<bitfield id="ENABLE0" width="1" begin="0" end="0" resetval="0x0" description="enable DMA reguest FIFO0" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="ADCREGS_DMAENABLE_CLR" acronym="ADCREGS_DMAENABLE_CLR" offset="0x3C" width="32" description="The DMAENABLE_CLR register allows the disabling of DMA requests">
		<bitfield id="ENABLE1" width="1" begin="1" end="1" resetval="0x0" description="clears the enable of the DMA reguest FIFO1. Disables DMA request when writing 1" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="ENABLE0" width="1" begin="0" end="0" resetval="0x0" description="clears the enable of the DMA reguest FIFO0. Disables DMA request when writing 1" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="ADCREGS_CONTROL" acronym="ADCREGS_CONTROL" offset="0x40" width="32" description="Controls various parameters of the cotroller state.">
		<bitfield id="HI_MID_SEL" width="1" begin="11" end="11" resetval="0x0" description="Functional safety debug mode. =1 choose ADCREFP, =0 VMID reference input to ADC" range="11" rwaccess="R/W"/> 
		<bitfield id="HI_MID_EN" width="1" begin="10" end="10" resetval="0x0" description="Functional safety debug mode. enable fixed reference to ADC for testing" range="10" rwaccess="R/W"/> 
		<bitfield id="HW_PREEMPT" width="1" begin="9" end="9" resetval="0x0" description="1 steps are preempted" range="9" rwaccess="R/W"/> 
		<bitfield id="HW_MAP" width="1" begin="8" end="8" resetval="0x0" description="1 = hw events enabled" range="8" rwaccess="R/W"/> 
		<bitfield id="PD" width="1" begin="4" end="4" resetval="0x1" description="AFE powered down" range="4" rwaccess="R/W"/> 
		<bitfield id="BIAS_SEL" width="1" begin="3" end="3" resetval="0x0" description="AFE select bias control" range="3" rwaccess="R/W"/> 
		<bitfield id="STEP_ID_EN" width="1" begin="1" end="1" resetval="0x0" description="writing 1 will store the stepid number with the captured adc data in the fifo" range="1" rwaccess="R/W"/> 
		<bitfield id="MODULE_ENABLE" width="1" begin="0" end="0" resetval="0x0" description="ADC12_SS module enable bit.  After programming all the configuration and step enable registers, write a 1 to this bit to start conversion. Writing a 0 will disable the module after the current conversion. Before turning on again, the ADC_SEQUENCER_STATUS  register show read back STEP_ID=Idle and FSM_BUSY=0. Enabling the controller will be held off until mem_init_done =1." range="0" rwaccess="R/W"/>
	</register>
	<register id="ADCREGS_SEQUENCER_STAT" acronym="ADCREGS_SEQUENCER_STAT" offset="0x44" width="32" description="SW can read this register to find out the currently 
scheduled step id being converted on the ADC port.
If you want to turn the controller off and then back on, 
the step_id bit should be checked and compared to IDLE 
before enabling the ADC12_SS module again.
Also, before enabling the controller again, 
the user should wait for the FSM bit 5 to read idl.">
		<bitfield id="GPADC_BUSY" width="1" begin="8" end="8" resetval="0x0" description="Monitor the AFE internal calibration, busy bit" range="8" rwaccess="R"/> 
		<bitfield id="MEM_INIT_DONE" width="1" begin="6" end="6" resetval="0x0" description="status of ram initialization, 1= ram initialization to 0 after reset is done." range="6" rwaccess="R"/> 
		<bitfield id="FSM_BUSY" width="1" begin="5" end="5" resetval="0x1" description="status of fsm, 1= conversion in progress" range="5" rwaccess="R"/> 
		<bitfield id="STEP_IDLE" width="5" begin="4" end="0" resetval="0x0" description="10000 = idle, 000000 -> 01111 corresponds to step 1 -> step 16" range="4 - 0" rwaccess="R"/>
	</register>
	<register id="ADCREGS_RANGE" acronym="ADCREGS_RANGE" offset="0x48" width="32" description="This feature requires the range check interrupt bit to be enabled first.
The user can decide  which channel input is compared by programming the RangeCheck bit of the StepConfig Registers.
It is up to software to sort through FIFO data to determine which channel data was out of range. 
Software should only use LSB 10 bits for comparison and make sure bits 11,12 are 0.">
		<bitfield id="HIRANGE" width="12" begin="27" end="16" resetval="0x0" description="If the sampled data is > value, then interrupt is generated" range="27 - 16" rwaccess="R/W"/> 
		<bitfield id="LOWRANGE" width="12" begin="11" end="0" resetval="0x0" description="If the sampled data is &#60; value, then interrupt is generated" range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="ADCREGS_MISC" acronym="ADCREGS_MISC" offset="0x50" width="32" description="Spare inputs of the AFE are driven by this register, spare outputs from the AFE are read.">
		<bitfield id="AFE_SPARE_OUT" width="4" begin="11" end="8" resetval="0x0" description="Spare outputs from AFE" range="11 - 8" rwaccess="R"/> 
		<bitfield id="AFE_SPARE_IN" width="4" begin="3" end="0" resetval="0x0" description="Spare inputs to AFE" range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="ADCREGS_STEPENABLE" acronym="ADCREGS_STEPENABLE" offset="0x54" width="32" description="Contains the enable bit for each step in the sequencer.
When all steps are disabled, the FSM will stay in IDLE state.
These bits can be enabled or disabled dynamically during operation.
When a write to this register occurs during operational mode, 
the HW will make sure the new settings are updated after the END_OF_SEQUENCE event">
		<bitfield id="STEP16" width="1" begin="16" end="16" resetval="0x0" description="Enable step" range="16" rwaccess="R/W"/> 
		<bitfield id="STEP15" width="1" begin="15" end="15" resetval="0x0" description="Enable step" range="15" rwaccess="R/W"/> 
		<bitfield id="STEP14" width="1" begin="14" end="14" resetval="0x0" description="Enable step" range="14" rwaccess="R/W"/> 
		<bitfield id="STEP13" width="1" begin="13" end="13" resetval="0x0" description="Enable step" range="13" rwaccess="R/W"/> 
		<bitfield id="STEP12" width="1" begin="12" end="12" resetval="0x0" description="Enable step" range="12" rwaccess="R/W"/> 
		<bitfield id="STEP11" width="1" begin="11" end="11" resetval="0x0" description="Enable step" range="11" rwaccess="R/W"/> 
		<bitfield id="STEP10" width="1" begin="10" end="10" resetval="0x0" description="Enable step" range="10" rwaccess="R/W"/> 
		<bitfield id="STEP9" width="1" begin="9" end="9" resetval="0x0" description="Enable step" range="9" rwaccess="R/W"/> 
		<bitfield id="STEP8" width="1" begin="8" end="8" resetval="0x0" description="Enable step" range="8" rwaccess="R/W"/> 
		<bitfield id="STEP7" width="1" begin="7" end="7" resetval="0x0" description="Enable step" range="7" rwaccess="R/W"/> 
		<bitfield id="STEP6" width="1" begin="6" end="6" resetval="0x0" description="Enable step" range="6" rwaccess="R/W"/> 
		<bitfield id="STEP5" width="1" begin="5" end="5" resetval="0x0" description="Enable step" range="5" rwaccess="R/W"/> 
		<bitfield id="STEP4" width="1" begin="4" end="4" resetval="0x0" description="Enable step" range="4" rwaccess="R/W"/> 
		<bitfield id="STEP3" width="1" begin="3" end="3" resetval="0x0" description="Enable step" range="3" rwaccess="R/W"/> 
		<bitfield id="STEP2" width="1" begin="2" end="2" resetval="0x0" description="Enable step" range="2" rwaccess="R/W"/> 
		<bitfield id="STEP1" width="1" begin="1" end="1" resetval="0x0" description="Enable step" range="1" rwaccess="R/W"/>
	</register>
	<register id="ADCREGS_FIFO0WC" acronym="ADCREGS_FIFO0WC" offset="0xE4" width="32" description="FIFO word count status">
		<bitfield id="NUMWDS" width="9" begin="8" end="0" resetval="0x0" description="number of words in the FIFO" range="8 - 0" rwaccess="R"/>
	</register>
