IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/ADC0.xml
	<register id="ADCREGS_FIFO0THRESHOLD" acronym="ADCREGS_FIFO0THRESHOLD" offset="0xE8" width="32" description="FIFO threshold">
		<bitfield id="THRESHOLD" width="8" begin="7" end="0" resetval="0x0" description="Program the desired FIFO0 data sample level minus 1 to reach before generating interrupt to CPU" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="ADCREGS_FIFO0DMAREQ" acronym="ADCREGS_FIFO0DMAREQ" offset="0xEC" width="32" description="dma request.">
		<bitfield id="DMAREQLEVEL" width="8" begin="7" end="0" resetval="0x0" description="Number of words minus 1 in FIFO0 before generating a DMA request " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="ADCREGS_FIFO1WC" acronym="ADCREGS_FIFO1WC" offset="0xF0" width="32" description="FIFO word count status">
		<bitfield id="NUMWDS" width="9" begin="8" end="0" resetval="0x0" description="number of words in the FIFO" range="8 - 0" rwaccess="R"/>
	</register>
	<register id="ADCREGS_FIFO1THRESHOLD" acronym="ADCREGS_FIFO1THRESHOLD" offset="0xF4" width="32" description="FIFO threshold">
		<bitfield id="THRESHOLD" width="8" begin="7" end="0" resetval="0x0" description="Program the desired FIFO1 data sample level minus 1 to reach before generating interrupt to CPU" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="ADCREGS_FIFO1DMAREQ" acronym="ADCREGS_FIFO1DMAREQ" offset="0xF8" width="32" description="dma request.">
		<bitfield id="DMAREQLEVEL" width="8" begin="7" end="0" resetval="0x0" description="Number of words minus 1 in FIFO1 before generating a DMA request " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="ADCREGS_FIFO0DATA" acronym="ADCREGS_FIFO0DATA" offset="0x100" width="32" description="A read from this register will auto increment the FIFO read pointer. 
If you read when FIFO is empty,it will trigger an underflow interrupt">
		<bitfield id="ADCCHANLID" width="4" begin="19" end="16" resetval="0x0" description="Optional ID tag of channel that captured the data. If tag option is disabled, these bits will be 0" range="19 - 16" rwaccess="R"/> 
		<bitfield id="ADCDATA" width="12" begin="11" end="0" resetval="0x0" description="sampled ADC converted data value stored in FIFO" range="11 - 0" rwaccess="R"/>
	</register>
	<register id="ADCREGS_FIFO1DATA" acronym="ADCREGS_FIFO1DATA" offset="0x200" width="32" description="A read from this register will auto increment the FIFO read pointer. 
If you read when FIFO is empty,it will trigger an underflow interrupt">
		<bitfield id="ADCCHANLID" width="4" begin="19" end="16" resetval="0x0" description="Optional ID tag of channel that captured the data. If tag option is disabled, these bits will be 0" range="19 - 16" rwaccess="R"/> 
		<bitfield id="ADCDATA" width="12" begin="11" end="0" resetval="0x0" description="sampled ADC converted data value stored in FIFO" range="11 - 0" rwaccess="R"/>
	</register>
	<register id="ADCREGS_EOI" acronym="ADCREGS_EOI" offset="0x20" width="32" description="The End of Interrupt (EOI) MISC Register allows the CPU to acknowledge completion of an interrupt by writing to the EOI for MISC interrupt sources. An eoi_write signal will be generated and another interrupt will be triggered if interrupt sources remain.  This register will be reset one cycle after it has been written to.">
		<bitfield id="LINENUMEOI" width="1" begin="0" end="0" resetval="0x0" description="Write 0 to flag End Of Interrupt." range="0" rwaccess="W"/>
	</register>
	<register id="ADCREGS_STATUS_RAW" acronym="ADCREGS_STATUS_RAW" offset="0x24" width="32" description="The IRQ_STATUS_RAW register allows the adc12 interrupt sources to be manually set when writing a 1 to a specific bit.  Write 0: No action Write 1: Set event Read 0: No event pending Read 1: Event pending">
		<bitfield id="OUTOFRANGE" width="1" begin="8" end="8" resetval="0x0" description="sample out of range" range="8" rwaccess="R/W1TS"/> 
		<bitfield id="FIFO1UNFL" width="1" begin="7" end="7" resetval="0x0" description="fifo under flow" range="7" rwaccess="R/W1TS"/> 
		<bitfield id="FIFO1OVFL" width="1" begin="6" end="6" resetval="0x0" description="fifo over flow" range="6" rwaccess="R/W1TS"/> 
		<bitfield id="FIFO1THRS" width="1" begin="5" end="5" resetval="0x0" description="fifo thresholds met" range="5" rwaccess="R/W1TS"/> 
		<bitfield id="FIFO0UNFL" width="1" begin="4" end="4" resetval="0x0" description="fifo under flow" range="4" rwaccess="R/W1TS"/> 
		<bitfield id="FIFO0OVFL" width="1" begin="3" end="3" resetval="0x0" description="fifo over flow" range="3" rwaccess="R/W1TS"/> 
		<bitfield id="FIFO0THRS" width="1" begin="2" end="2" resetval="0x0" description="fifo thresholds met" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="ENDOFEQUENCE" width="1" begin="1" end="1" resetval="0x0" description="end of sequence" range="1" rwaccess="R/W1TS"/> 
		<bitfield id="AFE_EOC_MISSING" width="1" begin="0" end="0" resetval="0x0" description="eoc from the analog front end missing at expected time after soc" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="ADCREGS_STATUS" acronym="ADCREGS_STATUS" offset="0x28" width="32" description="The IRQ_STATUS register allows the adc12 interrupt sources to be manually cleared when writing a 1 to a specific bit.   Write 0: No action Write 1: Clear event Read 0: No event pending Read 1: Event pending">
		<bitfield id="OUTOFRANGE" width="1" begin="8" end="8" resetval="0x0" description="sample out of range" range="8" rwaccess="R/W1TC"/> 
		<bitfield id="FIFO1UNFL" width="1" begin="7" end="7" resetval="0x0" description="fifo under flow" range="7" rwaccess="R/W1TC"/> 
		<bitfield id="FIFO1OVFL" width="1" begin="6" end="6" resetval="0x0" description="fifo over flow" range="6" rwaccess="R/W1TC"/> 
		<bitfield id="FIFO1THRS" width="1" begin="5" end="5" resetval="0x0" description="fifo thresholds met" range="5" rwaccess="R/W1TC"/> 
		<bitfield id="FIFO0UNFL" width="1" begin="4" end="4" resetval="0x0" description="fifo under flow" range="4" rwaccess="R/W1TC"/> 
		<bitfield id="FIFO0OVFL" width="1" begin="3" end="3" resetval="0x0" description="fifo over flow" range="3" rwaccess="R/W1TC"/> 
		<bitfield id="FIFO0THRS" width="1" begin="2" end="2" resetval="0x0" description="fifo thresholds met" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="ENDOFEQUENCE" width="1" begin="1" end="1" resetval="0x0" description="end of sequence" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="AFE_EOC_MISSING" width="1" begin="0" end="0" resetval="0x0" description="eoc from the analog front end missing at expected time after soc" range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="ADCREGS_ENABLE_SET" acronym="ADCREGS_ENABLE_SET" offset="0x2C" width="32" description="The IRQ_ENABLE_SET register allows the adc12 interrupt sources to be manually enabled when writing a 1 to a specific bit.  Write 0: No action Write 1: Enable event Read 0: Event is disabled Read 1: Event is enabled">
		<bitfield id="OUTOFRANGE" width="1" begin="8" end="8" resetval="0x0" description="sample out of range" range="8" rwaccess="R/W1TS"/> 
		<bitfield id="FIFO1UNFL" width="1" begin="7" end="7" resetval="0x0" description="fifo under flow" range="7" rwaccess="R/W1TS"/> 
		<bitfield id="FIFO1OVFL" width="1" begin="6" end="6" resetval="0x0" description="fifo over flow" range="6" rwaccess="R/W1TS"/> 
		<bitfield id="FIFO1THRS" width="1" begin="5" end="5" resetval="0x0" description="fifo thresholds met" range="5" rwaccess="R/W1TS"/> 
		<bitfield id="FIFO0UNFL" width="1" begin="4" end="4" resetval="0x0" description="fifo under flow" range="4" rwaccess="R/W1TS"/> 
		<bitfield id="FIFO0OVFL" width="1" begin="3" end="3" resetval="0x0" description="fifo over flow" range="3" rwaccess="R/W1TS"/> 
		<bitfield id="FIFO0THRS" width="1" begin="2" end="2" resetval="0x0" description="fifo thresholds met" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="ENDOFEQUENCE" width="1" begin="1" end="1" resetval="0x0" description="end of sequence" range="1" rwaccess="R/W1TS"/> 
		<bitfield id="AFE_EOC_MISSING" width="1" begin="0" end="0" resetval="0x0" description="eoc from the analog front end missing at expected time after soc" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="ADCREGS_ENABLE_CLR" acronym="ADCREGS_ENABLE_CLR" offset="0x30" width="32" description="The IRQ_ENABLE_CLR register allows the adc12 interrupt sources to be manually disabled when writing a 1 to a specific bit.  Write 0: No action Write 1: Disable event Read 0: Event is disabled Read 1: Event is enabled">
		<bitfield id="OUTOFRANGE" width="1" begin="8" end="8" resetval="0x0" description="sample out of range" range="8" rwaccess="R/W1TC"/> 
		<bitfield id="FIFO1UNFL" width="1" begin="7" end="7" resetval="0x0" description="fifo under flow" range="7" rwaccess="R/W1TC"/> 
		<bitfield id="FIFO1OVFL" width="1" begin="6" end="6" resetval="0x0" description="fifo over flow" range="6" rwaccess="R/W1TC"/> 
		<bitfield id="FIFO1THRS" width="1" begin="5" end="5" resetval="0x0" description="fifo thresholds met" range="5" rwaccess="R/W1TC"/> 
		<bitfield id="FIFO0UNFL" width="1" begin="4" end="4" resetval="0x0" description="fifo under flow" range="4" rwaccess="R/W1TC"/> 
		<bitfield id="FIFO0OVFL" width="1" begin="3" end="3" resetval="0x0" description="fifo over flow" range="3" rwaccess="R/W1TC"/> 
		<bitfield id="FIFO0THRS" width="1" begin="2" end="2" resetval="0x0" description="fifo thresholds met" range="2" rwaccess="R/W1TC"/> 
		<bitfield id="ENDOFEQUENCE" width="1" begin="1" end="1" resetval="0x0" description="end of sequence" range="1" rwaccess="R/W1TC"/> 
		<bitfield id="AFE_EOC_MISSING" width="1" begin="0" end="0" resetval="0x0" description="eoc from the analog front end missing at expected time after soc" range="0" rwaccess="R/W1TC"/>
	</register>
