IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/ADC0.xml
	<register id="ADCREGS_STEPCONFIG_0" acronym="ADCREGS_STEPCONFIG_0" offset="0x64" width="32" description="The user should write to this register the values 
of the input pins send to the AFE during step 1.
the StepConfig WriteEnable bit should be set to 1 before a write can occur.">
		<bitfield id="RANGECHECK" width="1" begin="27" end="27" resetval="0x0" description="0 = no range sel  1 = compare ADC data with range" range="27" rwaccess="R/W"/> 
		<bitfield id="FIFOSEL" width="1" begin="26" end="26" resetval="0x0" description="Sampled data will be stored in FIFO0 when = 0, FIFO1 when = 1" range="26" rwaccess="R/W"/> 
		<bitfield id="DIFF_CNTRL" width="1" begin="25" end="25" resetval="0x0" description="Differential control. Single ended when = 0, differential input when = 1" range="25" rwaccess="R/W"/> 
		<bitfield id="SEL_INP_SWC" width="4" begin="22" end="19" resetval="0x0" description="SEL_INP pins SW configuration" range="22 - 19" rwaccess="R/W"/> 
		<bitfield id="SEL_INM_SWM" width="4" begin="18" end="15" resetval="0x8" description="SEL_INM pins, negative differential" range="18 - 15" rwaccess="R/W"/> 
		<bitfield id="AVERAGING" width="3" begin="4" end="2" resetval="0x0" description="000 -> no average 001 -> 2 samples average 010 -> 4 samples average 011 -> 8 samples average   100 -> 16 samples average" range="4 - 2" rwaccess="R/W"/> 
		<bitfield id="MODE" width="2" begin="1" end="0" resetval="0x0" description="00  SW enabled one shot  01  SW enabled continuous    10  HW synchronized one-shot 11  HW synchronized continuous" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="ADCREGS_STEPDELAY_0" acronym="ADCREGS_STEPDELAY_0" offset="0x68" width="32" description="Controls number of clock periods to sample and delay">
		<bitfield id="SAMPLEDELAY" width="8" begin="31" end="24" resetval="0x0" description="number of ADC clock cycles to sample. Any value programmed here will be added to the minimum requirement of 1 clock cycle." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="OPENDELAY" width="18" begin="17" end="0" resetval="0x0" description="Program the number of ADC clock cycles to wait after applying the step  configuration registers and before sending the start of ADC conversion" range="17 - 0" rwaccess="R/W"/>
	</register>
	<register id="ADCREGS_STEPCONFIG_1" acronym="ADCREGS_STEPCONFIG_1" offset="0x6C" width="32" description="The user should write to this register the values 
of the input pins send to the AFE during step 1.
the StepConfig WriteEnable bit should be set to 1 before a write can occur.">
		<bitfield id="RANGECHECK" width="1" begin="27" end="27" resetval="0x0" description="0 = no range sel  1 = compare ADC data with range" range="27" rwaccess="R/W"/> 
		<bitfield id="FIFOSEL" width="1" begin="26" end="26" resetval="0x0" description="Sampled data will be stored in FIFO0 when = 0, FIFO1 when = 1" range="26" rwaccess="R/W"/> 
		<bitfield id="DIFF_CNTRL" width="1" begin="25" end="25" resetval="0x0" description="Differential control. Single ended when = 0, differential input when = 1" range="25" rwaccess="R/W"/> 
		<bitfield id="SEL_INP_SWC" width="4" begin="22" end="19" resetval="0x0" description="SEL_INP pins SW configuration" range="22 - 19" rwaccess="R/W"/> 
		<bitfield id="SEL_INM_SWM" width="4" begin="18" end="15" resetval="0x8" description="SEL_INM pins, negative differential" range="18 - 15" rwaccess="R/W"/> 
		<bitfield id="AVERAGING" width="3" begin="4" end="2" resetval="0x0" description="000 -> no average 001 -> 2 samples average 010 -> 4 samples average 011 -> 8 samples average   100 -> 16 samples average" range="4 - 2" rwaccess="R/W"/> 
		<bitfield id="MODE" width="2" begin="1" end="0" resetval="0x0" description="00  SW enabled one shot  01  SW enabled continuous    10  HW synchronized one-shot 11  HW synchronized continuous" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="ADCREGS_STEPDELAY_1" acronym="ADCREGS_STEPDELAY_1" offset="0x70" width="32" description="Controls number of clock periods to sample and delay">
		<bitfield id="SAMPLEDELAY" width="8" begin="31" end="24" resetval="0x0" description="number of ADC clock cycles to sample. Any value programmed here will be added to the minimum requirement of 1 clock cycle." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="OPENDELAY" width="18" begin="17" end="0" resetval="0x0" description="Program the number of ADC clock cycles to wait after applying the step  configuration registers and before sending the start of ADC conversion" range="17 - 0" rwaccess="R/W"/>
	</register>

	<register id="ADCREGS_STEPCONFIG_2" acronym="ADCREGS_STEPCONFIG_2" offset="0x74" width="32" description="The user should write to this register the values 
of the input pins send to the AFE during step 1.
the StepConfig WriteEnable bit should be set to 1 before a write can occur.">
		<bitfield id="RANGECHECK" width="1" begin="27" end="27" resetval="0x0" description="0 = no range sel  1 = compare ADC data with range" range="27" rwaccess="R/W"/> 
		<bitfield id="FIFOSEL" width="1" begin="26" end="26" resetval="0x0" description="Sampled data will be stored in FIFO0 when = 0, FIFO1 when = 1" range="26" rwaccess="R/W"/> 
		<bitfield id="DIFF_CNTRL" width="1" begin="25" end="25" resetval="0x0" description="Differential control. Single ended when = 0, differential input when = 1" range="25" rwaccess="R/W"/> 
		<bitfield id="SEL_INP_SWC" width="4" begin="22" end="19" resetval="0x0" description="SEL_INP pins SW configuration" range="22 - 19" rwaccess="R/W"/> 
		<bitfield id="SEL_INM_SWM" width="4" begin="18" end="15" resetval="0x8" description="SEL_INM pins, negative differential" range="18 - 15" rwaccess="R/W"/> 
		<bitfield id="AVERAGING" width="3" begin="4" end="2" resetval="0x0" description="000 -> no average 001 -> 2 samples average 010 -> 4 samples average 011 -> 8 samples average   100 -> 16 samples average" range="4 - 2" rwaccess="R/W"/> 
		<bitfield id="MODE" width="2" begin="1" end="0" resetval="0x0" description="00  SW enabled one shot  01  SW enabled continuous    10  HW synchronized one-shot 11  HW synchronized continuous" range="1 - 0" rwaccess="R/W"/>
	</register>
